app/Models/Acudientes_model.php

    public function getAcudientes()
    {
      $builder = $this->db->table('acudiente a');
      $builder ->select("a.*, g.nombre as genero, u.username as usuario, u.password as contraseña");
      $builder ->join('generos g', 'a.genero_id = g.id');
      $builder ->join('usuarios u', 'a.usuario_id = u.id');
      $builder ->where('a.estado', 1);
      $query = $builder->get();
---
SELECT `a`.*, `g`.`nombre` as `genero`, `u`.`username` as `usuario`, `u`.`password` as `contraseña`
FROM `acudiente` `a`
JOIN `generos` `g` ON `a`.`genero_id` = `g`.`id`
JOIN `usuarios` `u` ON `a`.`usuario_id` = `u`.`id`
WHERE `a`.`estado` = 1

    public function getGeneros()
    {
      $builder = $this->db->table('generos');
      $resultados = $builder->get();
---
SELECT *
FROM `generos`

    public function getAcudiente($id)
    {
      $builder = $this->db->table('acudiente a');
      $builder ->select("a.*, g.nombre as genero, u
      .username as usuario, u.password as contraseña");
      $builder->join('genero g', 'a.genero_id
      = g.id');
      $builder ->join('usuario u', 'a.usuario_id= u.id');
      $builder->where('a.id', $id);
      $builder->where('a.estado', '1');
      $query = $builder->get();
---
SELECT `a`.*, `g`.`nombre` as `genero`, `u`.`username` as `username`, `u`.`password` as `contraseña`
FROM `acudiente` `a`
JOIN `generos` `g` ON `a`.`genero_id`
      = `g`.`id`
JOIN `usuarios` `u` ON `a`.`usuario_id`= `u`.`id`
WHERE `a`.`id` = '3'
AND `a`.`estado` = '1'