app/Models/Alumnos_model.php

  public function getAlumnos()
    {
      return $this->select("estudiantes.*,
                            generos.nombre as genero,
                            tipo_documento.sigla as tipoDocumentoSigla,
                            tipo_documento.nombre as tipoDocumentoNombre,
                            acudiente.nombres as nomAcudiente,
                            acudiente.celular as celAcudiente,
                            usuarios.username as usuario,
                            usuarios.password as contraseña")

                  ->join("generos", "estudiantes.genero_id = generos.id")
                  ->join("tipo_documento", "estudiantes.tipodocumento_id = tipo_documento.id")
                  ->join("acudiente", "estudiantes.acudiente_id = acudiente.id")
                  ->join("usuarios", "estudiantes.usuario_id = usuarios.id")
                  ->where("estudiantes.estado","1")
                  ->asObject()
                  ->findAll();
---
SELECT `estudiantes`.*, `generos`.`nombre` as `genero`, `tipo_documento`.`sigla` as `tipoDocumentoSigla`, `tipo_documento`.`nombre` as `tipoDocumentoNombre`, `acudiente`.`nombres` as `nomAcudiente`, `acudiente`.`celular` as `celAcudiente`, `usuarios`.`username` as `usuario`, `usuarios`.`password` as `contraseña`
FROM `estudiantes`
JOIN `generos` ON `estudiantes`.`genero_id` = `generos`.`id`
JOIN `tipo_documento` ON `estudiantes`.`tipodocumento_id` = `tipo_documento`.`id`
JOIN `acudiente` ON `estudiantes`.`acudiente_id` = `acudiente`.`id`
JOIN `usuarios` ON `estudiantes`.`usuario_id` = `usuarios`.`id`
WHERE `estudiantes`.`estado` = '1'

    public function getGeneros()
    {
      return $this->db->table("generos")
                      ->get()
                      ->getResultArray();
---
SELECT *
FROM `generos`

    public function getTipoDocumentos()
    {
      return $this->db->table("tipo_documento")
                      ->get()
                      ->getResultArray();
---
SELECT *
FROM `tipo_documento`

    public function getAcudientes()
    {
      return $this->db->table("acudiente")
                      ->get()
                      ->getResultArray();
---
SELECT *
FROM `acudiente`

    public function getGrupoSanguineo()
    {
      return $this->db->table("grupo_sanguineo")
                      ->get()
                      ->getResultArray();
---
SELECT *
FROM `grupo_sanguineo`

    public function getAlumno($id)
    {
      return $this->db->table("estudiante e")
                      ->select("e.*,g.nombre as genero,
                                td.sigla as tipoDocumentoSigla,
                                td.nombre as tipoDocumentoNombre,
                                a.nombres as nomAcudiente,
                                a.celular as celAcudiente,
                                u.username as usuario,
                                u.password as contraseña")
                      ->join("generos g", "e.genero_id = g.id")
                      ->join("tipo_documento td", "e.tipodocumento_id = td.id")
                      ->join("acudiente a  ", "e.acudiente_id = a.id")
                      ->join("usuarios u  ", "e.usuario_id = u.id")
                      ->where("e.id",$id)
                      ->where("e.estado","1")
                      ->get()
                      ->getRow();
---
SELECT `e`.*, `g`.`nombre` as `genero`, `td`.`sigla` as `tipoDocumentoSigla`, `td`.`nombre` as `tipoDocumentoNombre`, `a`.`nombres` as `nomAcudiente`, `a`.`celular` as `celAcudiente`, `u`.`username` as `usuario`, `u`.`password` as `contraseña`
FROM `estudiantes` `e`
JOIN `generos` `g` ON `e`.`genero_id` = `g`.`id`
JOIN `tipo_documento` `td` ON `e`.`tipodocumento_id` = `td`.`id`
JOIN `acudiente` `a` ON `e`.`acudiente_id` = `a`.`id`
JOIN `usuarios` `u` ON `e`.`usuario_id` = `u`.`id`
WHERE `e`.`id` = '9'
AND `e`.`estado` = '1'