app/Models/Usuarios_model.php

SELECT *
FROM `usuarios`
WHERE `username` = 'Oscar'
AND `password` = '7110eda4d09e062aa5e4a390b0a572ac0d2c0220'
 LIMIT 1
---
    public function login($username, $password)
    {
        return $this->where("username", $username)
                    ->where("password", $password)
                    ->first();